levkropp/cyd-emulator/test-firmware/10-freertos-minimal/sdkconfig.defaults
# ESP32 target
CONFIG_IDF_TARGET="esp32"

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Logging (verbose for debugging)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y
